import numpy as np
import requests 

from matrix_run import *

matrix_1 = """
+-----+-----+-----+-----+
|  10 |  20 |  30 |  40 |
+-----+-----+-----+-----+
|  50 |  60 |  70 |  80 |
+-----+-----+-----+-----+
|  90 | 100 | 110 | 120 |
+-----+-----+-----+-----+
| 130 | 140 | 150 | 160 |
+-----+-----+-----+-----+"""

matrix_2 = """
+-----+-----+-----+
|  10 |  20 |  30 |
+-----+-----+-----+
|  40 |  50 |  60 | 
+-----+-----+-----+
|  70 |  80 |  90 | 
+-----+-----+-----+"""

matrix_3 = """
+-----+-----+-----+-----+-----+
|   1 |   2 |   3 |  4  |   5 |
+-----+-----+-----+-----+-----+
|   6 |   7 |   8 |   9 |  10 |
+-----+-----+-----+-----+-----+
|  11 |  12 |  13 |  14 |  15 |
+-----+-----+-----+-----+-----+
|  16 |  17 |  18 |  19 |  20 |
+-----+-----+-----+-----+-----+
|  21 |  22 |  23 |  24 |  25 |
+-----+-----+-----+-----+-----+"""

matrixes = (matrix_1, matrix_2, matrix_3)

for mat in matrixes:
    print(mat)
    result_list = matrix_run(matrix_from_text(mat), 'L')
    print("Результат обхода матрицы против часовой стрелки:")
    list_print(result_list)

    result_list = matrix_run(matrix_from_text(mat), 'R')
    print("Результат обхода матрицы по часовой стрелке:")
    list_print(result_list)
 
    print("=" * 50)

